---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizes.Dispose
source: html/c1984717-dba2-91c7-7974-83248a3e58e7.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizes.Dispose Method

Releases all resources used by the DuctSizes

## Syntax (C#)
```csharp
public void Dispose()
```